In [1]:
import pandas

df = pandas.read_csv('./data/welfare.csv')
df.head()

   gender  birth  marriage  religion  code_job  income  code_religion
0       2   1936         2         2       NaN     NaN              1
1       2   1945         2         2       NaN     NaN              1
2       1   1948         2         2     942.0   120.0              1
3       1   1942         3         1     762.0   200.0              1
4       2   1923         2         1       NaN     NaN              1

# Data 형식

In [3]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

# Data 전체 크기 (Row, column)의 수

In [4]:
print(df.shape)

(16664, 7)

In [5]:
print(df.shape[0])
print(df.shape[1])

16664
7

In [6]:
print(df.columns)

Index(['gender', 'birth', 'marriage', 'religion', 'code_job', 'income',
       'code_religion'],
      dtype='object')

# 각 컬럼들의 데이터 타입 정보

In [7]:
print(df.dtypes)
# str = object

gender             int64
birth              int64
marriage           int64
religion           int64
code_job         float64
income           float64
code_religion      int64
dtype: object

# info() -> DataFrame 데이터 구조를 알려 줌

In [8]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16664 entries, 0 to 16663
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   gender         16664 non-null  int64
 1   birth          16664 non-null  int64
 2   marriage       16664 non-null  int64
 3   religion       16664 non-null  int64
 4   code_job       7529 non-null   float64
 5   income         4634 non-null   float64
 6   code_religion  16664 non-null  int64
dtypes: float64(2), int64(5)
memory usage: 911.4 KB
None

# 대괄호 사용으로 특정 컬럼에 대한 정보 추출

In [15]:
gender_df = df['gender']
# head - 앞 5개
print(gender_df.head())
print(type(gender_df))

0    2
1    2
2    1
3    1
4    2
Name: gender, dtype: int64
<class 'pandas.core.series.Series'>

In [17]:
# tail - 끝 5개
print(gender_df.tail())

16659    2
16660    2
16661    1
16662    2
16663    1
Name: gender, dtype: int64

# 2개 이상의 컬럼을 조회하고자 하는 경우

# 외부의 대괄호는 인덱싱을 위한 대괄호이고, 내부 대괄호는 list를 의미

In [23]:
subset = df [['gender', 'birth', 'marriage']]
print(type(subset))
subset.head()

<class 'pandas.core.frame.DataFrame'>

   gender  birth  marriage
0       2   1936         2
1       2   1945         2
2       1   1948         2
3       1   1942         3
4       2   1923         2

In [24]:
subset.tail()

       gender  birth  marriage
16659       2   1967         1
16660       2   1992         5
16661       1   1995         5
16662       2   1998         0
16663       1   2001         0

# loc 속성으로 라벨의 이름을 이용하여 행 또는 열의 위치 찾기

In [25]:
df.loc[0]

gender              2.0
birth            1936.0
marriage            2.0
religion            2.0
code_job            NaN
income              NaN
code_religion       1.0
Name: 0, dtype: float64

In [26]:
df.loc[99]

gender              2.0
birth            1938.0
marriage            1.0
religion            2.0
code_job            NaN
income              NaN
code_religion       1.0
Name: 99, dtype: float64

# last_row_index -> 마지막 행 번호

In [27]:
number_of_rows = df.shape[0]
last_row_index = number_of_rows -1

df.loc[last_row_index]

gender              1.0
birth            2001.0
marriage            0.0
religion            1.0
code_job            NaN
income              NaN
code_religion       5.0
Name: 16663, dtype: float64

# tail() - 마지막 행의 일부분을 추출할 때 사용하는 함수 (매개변수(n) 기본값  = 5)

In [28]:
df.tail(n=1)

       gender  birth  marriage  religion  code_job  income  code_religion
16663       1   2001         0         1       NaN     NaN              5

In [29]:
df.tail(n=2)

       gender  birth  marriage  religion  code_job  income  code_religion
16662       2   1998         0         1       NaN     NaN              5
16663       1   2001         0         1       NaN     NaN              5

In [30]:
df.loc[[0,99,999]]

     gender  birth  marriage  religion  code_job  income  code_religion
0         2   1936         2         2       NaN     NaN              1
99        2   1938         1         2       NaN     NaN              1
999       1   1955         1         1     510.0   129.0              1

# tail 메소드의 반환 결과는 DataFrame이고, loc 속성의 반환 결과는 Series.

In [31]:
subset_loc = df.loc[0]
subset_tail = df.tail(n=1)
print(type(subset_loc))
print(type(subset_tail))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

# iloc 함수는 행 인덱스 번호를 기준으로 행을 추출하는 함수

In [32]:
df.iloc[1]

gender              2.0
birth            1945.0
marriage            2.0
religion            2.0
code_job            NaN
income              NaN
code_religion       1.0
Name: 1, dtype: float64

In [33]:
df.iloc[99]

gender              2.0
birth            1938.0
marriage            1.0
religion            2.0
code_job            NaN
income              NaN
code_religion       1.0
Name: 99, dtype: float64

In [34]:
# 음수 - 마지막행 
df.iloc[-1]

gender              1.0
birth            2001.0
marriage            0.0
religion            1.0
code_job            NaN
income              NaN
code_religion       5.0
Name: 16663, dtype: float64

In [35]:
df.iloc[1710]

gender              1.0
birth            2009.0
marriage            0.0
religion            1.0
code_job            NaN
income              NaN
code_religion       2.0
Name: 1710, dtype: float64

In [36]:
df.iloc[[0,99,999]]

     gender  birth  marriage  religion  code_job  income  code_religion
0         2   1936         2         2       NaN     NaN              1
99        2   1938         1         2       NaN     NaN              1
999       1   1955         1         1     510.0   129.0              1

In [38]:
print( f'\n# 컬럼 이름으로 서로 떨어진 컬럼에 대한 슬라이싱 \n{'-'*50}')
subset = df.loc[:, ['marriage', 'income']]
subset.head()

# 컬럼 이름으로 서로 떨어진 컬럼에 대한 슬라이싱
--------------------------------------------------

   marriage  income
0         2     NaN
1         2     NaN
2         2   120.0
3         3   200.0
4         2     NaN

In [39]:
subset = df.iloc[:, [2,4,-1]]
subset.head()

   marriage  code_job  code_religion
0         2       NaN              1
1         2       NaN              1
2         2     942.0              1
3         3     762.0              1
4         2       NaN              1

# range() 메소드 사용하여 데이터 추출하기

In [42]:
small_range = list(range(5))
print(small_range)

[0, 1, 2, 3, 4]

In [44]:
print(type(small_range))

<class 'list'>

In [46]:
small_range = list(range(3,6))
print(small_range)

[3, 4, 5]

In [47]:
subset = df.iloc[:, small_range]
subset.head()

   religion  code_job  income
0         2       NaN     NaN
1         2       NaN     NaN
2         2     942.0   120.0
3         1     762.0   200.0
4         1       NaN     NaN

In [48]:
small_range = list(range(0,6,2))
subset = df.iloc[:, small_range]
subset.head()

   gender  marriage  code_job
0       2         2       NaN
1       2         2       NaN
2       1         2     942.0
3       1         3     762.0
4       2         2       NaN

# GroupBy 매카닉

# 데이터 분할(split) -> 반영(`) -> 결합(combine)

In [49]:
df.head(n=10)

   gender  birth  marriage  religion  code_job  income  code_religion
0       2   1936         2         2       NaN     NaN              1
1       2   1945         2         2       NaN     NaN              1
2       1   1948         2         2     942.0   120.0              1
3       1   1942         3         1     762.0   200.0              1
4       2   1923         2         1       NaN     NaN              1
5       1   1962         1         1     530.0     NaN              1
6       2   1963         1         1       NaN     NaN              1
7       2   2003         0         1       NaN     NaN              1
8       1   1927         1         1       NaN     NaN              1
9       2   1934         1         1       NaN     NaN              1

# unique() - 중복값을 제거하고, 유일값만 저장하는 numpy 객체 반환 = distinct

In [52]:
df['marriage'].unique()

array([2, 3, 1, 0, 5, 4, 6])

In [54]:
print( f'\n# marriage컬럼에 대하여 그룹핑을 수행한 후 code_religion 컬럼의 평균 구하기 \n{'-'*80}')

df.groupby('marriage')['code_religion'].mean()
#결혼 상태(marriage)별로 사람들을 나누고, 각 그룹의 종교 유무(code_religion) 평균
# 기혼자 그룹과 미혼자 그룹 중 어느 쪽이 평균적으로 종교를 더 많이 가지고 있을까?

# marriage컬럼에 대하여 그룹핑을 수행한 후 code_religion 컬럼의 평균 구하기
--------------------------------------------------------------------------------

marriage
0    3.655365
1    3.726723
2    4.024563
3    3.648876
4    3.880952
5    3.420058
6    3.653846
Name: code_religion, dtype: float64

In [55]:
mygrouping = df.groupby('marriage')
print(type(mygrouping))
print(mygrouping)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000281A9568190>

In [56]:
grp_code_religion = mygrouping['code_religion']
print(type(grp_code_religion))

<class 'pandas.core.groupby.generic.SeriesGroupBy'>

In [57]:
mean_code_religion = grp_code_religion.mean()
print(mean_code_religion)

marriage
0    3.655365
1    3.726723
2    4.024563
3    3.648876
4    3.880952
5    3.420058
6    3.653846
Name: code_religion, dtype: float64

In [59]:
print( f'\n# marriage, birth 컬럼을 이용하여 그룹화시킨 후 code_religion, incom에 대한 평균 값 출력 \n{'-'*80}')
mygrouping2 = df.groupby(['marriage', 'birth'])
result = mygrouping2[['code_religion', 'income']].mean()
result

# marriage, birth 컬럼을 이용하여 그룹화시킨 후 code_religion, incom에 대한 평균 값 출력
--------------------------------------------------------------------------------

                code_religion  income
marriage birth
0        1997        3.808081     NaN
         1998        3.652850     NaN
         1999        3.626794     NaN
         2000        3.635945     NaN
         2001        3.578947     NaN
...                       ...     ...
6        1946        3.000000     NaN
         1947        4.000000     NaN
         1959        4.000000     NaN
         1960        2.000000     NaN
         1967        7.000000     NaN

[339 rows x 2 columns]

In [62]:
# 한줄 
df.groupby(['marriage', 'birth'])[['code_religion', 'income']].mean()

                code_religion  income
marriage birth
0        1997        3.808081     NaN
         1998        3.652850     NaN
         1999        3.626794     NaN
         2000        3.635945     NaN
         2001        3.578947     NaN
...                       ...     ...
6        1946        3.000000     NaN
         1947        4.000000     NaN
         1959        4.000000     NaN
         1960        2.000000     NaN
         1967        7.000000     NaN

[339 rows x 2 columns]